# ==============================================================
# 0. 라이브러리 불러오기
# ==============================================================
import zipfile
import os
import shutil
import pandas as pd

# ==============================================================
# 1. 함수 정의
# ==============================================================
def delete(path):
    if os.path.isfile(path):
        os.remove(path)
    elif os.path.isdir(path):
        shutil.rmtree(path)
    else:
        raise ValueError("해당 경로를 확인해주세요")

# ==============================================================
# 2. 경로 설정
# ==============================================================
path = "/home/hi/PycharmProjects/Test/zipfile/"
os.chdir(path) # 이렇게 하지 않으면 상위 경로 전체가 한꺼번에 압축되어버림 ★★★

# ==============================================================
# 3. Zip파일 List 불러오기
# ==============================================================
zip_list = os.listdir(path)

# ==============================================================
# 4. 압축 해제
# ==============================================================
# 1) 모든 zip파일 압축 해제
for z in zip_list:
    zipfile.ZipFile(z).extractall()
    delete(z)
